--[[

	Powered By :
		 _____       _  ____
		| ____|_ __ (_)/ ___|_ __ ___   __ _ TM
		|  _| | '_ \| | |  _| '_ ` _ \ / _` |
		| |___| | | | | |_| | | | | | | (_| |
		|_____|_| |_|_|\____|_| |_| |_|\__,_|
	
	****************************
	*  >> By : Reza Mehdipour  *
	*  > Channel : @EnigmaTM   *
	****************************
	
]]

HelpListUtilNow = [[
💠 لیست آموزش های بات تا کنون :
➖➖➖➖

1⃣- راهنمای قفل ها
مربوط به قفل های بات ، دریافت تنظیمات و ...

2⃣- راهنمای فیلتر
مربوط به فیلتر کلمات ، دریافت لیست فیلتر و ...

3⃣- راهنمای اطلاعات
مربوط به دریافت اطلاعات کاملی از خود ، گروه و ...


➖➖➖➖
👈 برای دریافت هر آموزش عبارت آن را تایپ کنید .
✅ برای مثال :

راهنمای قفل ها
]]
---------------------------------------

-- راهنمای قفل ها
LocksHelp = [[
📝 راهنمای قفل های بات :

✅ = فعال کردن
❌ = غیرفعال کردن

━━━ 🔐 قفل های اصلی ⏬ ━━━

🔗 جلوگیری از ارسال لینک :

✅ قفل لینک
❌ بازکردن لینک
━━━━━━━━━━
➡️ قفل فروارد :

✅ قفل فروارد
❌ بازکردن فروارد
━━━━━━━━━━
⌨ حذف کیبورد (دکمه) های شیشه ای :

✅ قفل کیبورد
❌ بازکردن کیبورد
━━━━━━━━━━
🖥  پاسخ ندادن بات به کاربران عادی در گروه :

✅ قفل دستورات
❌ بازکردن دستورات
━━━━━━━━━━
🔶 حذف پیام های انگلیسی :

✅ قفل انگلیسی
❌ بازکردن انگلیسی
━━━━━━━━━━
🔷 حذف پیام های فارسی و عربی :

✅ قفل فارسی
❌ بازکردن فارسی
━━━━━━━━━━
🔖 حذف پیام های طولانی :

✅ قفل اسپم
❌ بازکردن اسپم
━━━━━━━━━━
☠ اخراج کاربری که در گروه پیام رگباری ارسال کند :

✅ قفل رگباری
❌ بازکردن رگباری

🔧تنظیم حساسیت پیام های رگباری (مکرر) :

⚜ تنظیم اسپم 7
» به جای 7 میتوانید اعداد 5 تا 20 را قرار دهید.

━━━━━━━━━━
🤖 اخراج ربات هایی که وارد گروه میشوند :

✅ قفل ربات
❌ بازکردن ربات
━━━━━━━━━━
💼 حذف پیام ورود و خروج کاربران از گروه :

✅ قفل خدمات
❌ بازکردن خدمات

━━━ 🗂 قفل های رسانه ای ⏬ ━━━

🔊 حذف صدا و ویس ارسالی در گروه :

✅ قفل صدا
❌ بازکردن صدا
━━━━━━━━━━  
🌅 حدف تصاویر ارسالی :

✅ قفل عکس
❌ بازکردن عکس
━━━━━━━━━━
🎥 حذف ویدیو ارسالی :

✅ قفل ویدیو
❌ بازکردن ویدیو
━━━━━━━━━━
📥 حذف فایل های ارسالی :

✅ قفل فایل
❌ بازکردن فایل
━━━━━━━━━━
📋 حذف متنی که به تنهایی ارسال میشود :

✅ قفل متن
❌ بازکردن متن
━━━━━━━━━━
☂ حذف گیف (عکس متحرک) ارسالی :

✅ قفل گیف
❌ بازکردن گیف
━━━━━━━━━━
🚏حذف استیکر های ارسالی :

✅ قفل استیکر
❌ بازکردن استیکر
━━━━━━━━━━
📍قفل ارسال مخاطب (Share Contact) :

✅ قفل مخاطب
❌ بازکردن مخاطب

━━━━ 💢 قفل های مهم ━━━━

♨️ اخراج کاربری که در گروه لینکی ارسال کند :

✅ قفل سخت
❌ بازکردن سخت
━━━━━━━━━━
🚫 حذف تمامی پیام های ارسالی در گروه (بستن چت) :

✅ قفل چت
❌ بازکردن چت

━━━━━━━━━━
🛠 نمایش تنظیمات گروه :

⚜ تنظیمات
━━━━━━━━━━━━━━━━━━
    🔱 [~ <b>EniGma</b>™ ~] 🔱
     » [ @EnigmaTM ] «
]]

FilterHelp = [[
✅ آموزش فیلتر کلمات :
ا➖➖➖➖

💡بار فیلتر کردن یک کلمه ، بات در صورت مشاهده ی اون کلمه در یک متن ، اون متن رو حذف خواهد کرد.

ا➖➖➖➖
👈 دستورات قسمت فیلتر :

➕ فیلتر کردن یک کلمه :
فیلتر کلمه

➖ رفع فیلتر یک کلمه :
رفع فیلتر کلمه

📝 دریافت لیست کلمات فیلتر شده :
لیست فیلتر

❌ حذف کل کلمات فیلتر شده :
پاکسازی لیست فیلتر
ا➖➖➖➖

➕ مثال فیلتر کردن یک کلمه :
فیلتر احمق

» در اینجا عبارت "احمق" فیلتر خواهد شد.

➖ مثال رفع فیلتر یک کلمه :
رفع فیلتر احمق

» در این قسمت عبارت "احمق" رفع فیلتر خواهد شد.
➖➖➖➖
    🔱 [~ <b>EniGma</b>™ ~] 🔱
     » [ @EnigmaTM ] «
]]


GroupInformationHelp = [[
✅ راهنمای دریافت اطلاعات :
ا➖➖➖➖
👈 دستور دریافت اطلاعات کلی درباره ی خود :
اطلاعات

👈 دستور دریافت اطلاعات کلی گروه :
اطلاعات گروه

👈 دستور دریافت لیست ادمین های گروه :
ادمین ها

👈 دستور دریافت لیست مدیران فرعی بات در گروه :
مدیران فرعی

👈 دستور دریافت لیست بات های API موجود در گروه :
ربات ها

👈 دستور دریافت آیدی مدیر اصلی بات در گروه :
مدیر اصلی
ا➖➖➖➖
📎 کار با لینک در گروه :

🔅دستور تنظیم لینک در گروه :
تنظیم لینک

🔅دستور دریافت لینک گروه :
لینک

➖➖➖➖
    🔱 [~ <b>EniGma</b>™ ~] 🔱
     » [ @EnigmaTM ] «
]]


local function run(msg,matches)

	------- LOCK CMD
	data = load_data(_config.moderation.data)
	if data[tostring(msg.to.id)] then
		if data[tostring(msg.to.id)]['settings'] then
			if data[tostring(msg.to.id)]['settings']['lock_cmd'] then
				lock_cmd = data[tostring(msg.to.id)]['settings']['lock_cmd']
				if lock_cmd == "yes" and not is_momod(msg) then
					return
				end
			end
		end
	end
	-------
	
	if matches[1] == "راهنما" then
		return reply_msg(msg.id,HelpListUtilNow,ok_cb,false)
	end
	
	if matches[1] == "راهنمای" and matches[2] then
		
		if matches[2] == "قفل ها" then
			return reply_msg(msg.id,LocksHelp,ok_cb,false)
		end
		
		if matches[2] == "فیلتر" then
			return reply_msg(msg.id,FilterHelp,ok_cb,false)
		end
		
		if matches[2] == "اطلاعات" then
			return reply_msg(msg.id,GroupInformationHelp,ok_cb,false)
		end
		
	end -- end matches[1] == "راهنمای"

end	

return {
patterns = {
	"^(راهنما)$",
	"^(راهنمای) (.*)"
},
	run = run
}

--[[

	Powered By :
		 _____       _  ____
		| ____|_ __ (_)/ ___|_ __ ___   __ _ TM
		|  _| | '_ \| | |  _| '_ ` _ \ / _` |
		| |___| | | | | |_| | | | | | | (_| |
		|_____|_| |_|_|\____|_| |_| |_|\__,_|
	
	****************************
	*  >> By : Reza Mehdipour  *
	*  > Channel : @EnigmaTM   *
	****************************
	
]]